# Pandas Exercises

In [2]:
import pandas as pd

NameError: name 'pwd' is not defined

In [ ]:
# **TASK:  Read in the bank.csv file that is located under project folder. Pay close attention to where the .csv file is located!

In [4]:
df = pd.read_csv('/Users/elifseven/Desktop/PytorchUdemy/bank.csv')

**TASK: Display the first 5 rows of the data set**

In [8]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [9]:
df.loc[:5]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
5,35,management,single,tertiary,no,747,no,no,cellular,23,feb,141,2,176,3,failure,no

**TASK: What is the average (mean) age of the people in the dataset?**

In [10]:
 df['age'].mean()

41.17009511170095

**TASK: What is the marital status of the youngest person in the dataset?**

[HINT](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmin.html)

In [14]:
df['age'].idxmin()

503

In [18]:
df['age'].loc[503]

19

In [19]:
df[df['age'] == 19]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
503,19,student,single,primary,no,103,no,no,cellular,10,jul,104,2,-1,0,unknown,yes
1900,19,student,single,unknown,no,0,no,no,cellular,11,feb,123,3,-1,0,unknown,no
2780,19,student,single,secondary,no,302,no,no,cellular,16,jul,205,1,-1,0,unknown,yes
3233,19,student,single,unknown,no,1169,no,no,cellular,6,feb,463,18,-1,0,unknown,no

**TASK: How many unique job categories are there?**

In [20]:
df['job'].nunique()

12

**TASK: How many people are there per job category? (Take a peek at the expected output)**

In [22]:
df['job'].value_counts()

management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64

**TASK: What percent of people in the dataset were married? **

In [26]:
100*df['marital'].value_counts()['married']/len(df)

61.86684361866843

**TASK: There is a column labeled "default". Use pandas' .map() method to create a new column called "default code" which contains a 0 if there was no default, or a 1 if there was a default. Then show the head of the dataframe with this new column.**

[Helpful Hint Link One](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html)

[Helpful Hint Link Two](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas)

In [29]:
df['default code'] = df['default'].map({'no':0,'yes':1})

In [30]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

**TASK: Using pandas .apply() method, create a new column called "marital code". This column will only contained a shortened code of the possible marital status first letter. (For example "m" for "married" , "s" for "single" etc... See if you can do this with a lambda expression. Lots of ways to do this one!**

[Hint Link](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html)

In [41]:
#Option1
df['marital code'] = df['marital'].apply(lambda status : status[0])

In [42]:
#Option2
def first_letter(status):
    return status[0]

In [43]:
df['marital'].apply(first_letter)

0       m
1       m
2       s
3       m
4       m
5       s
6       m
7       m
8       m
9       m
10      m
11      m
12      m
13      s
14      m
15      m
16      m
17      s
18      s
19      m
20      d
21      d
22      s
23      m
24      m
25      m
26      m
27      m
28      m
29      m
       ..
4491    s
4492    s
4493    s
4494    s
4495    m
4496    s
4497    s
4498    m
4499    d
4500    m
4501    m
4502    m
4503    m
4504    s
4505    s
4506    d
4507    m
4508    m
4509    m
4510    d
4511    m
4512    m
4513    m
4514    m
4515    s
4516    m
4517    m
4518    m
4519    m
4520    s
Name: marital, Length: 4521, dtype: object

**TASK: What was the longest lasting duration?**

In [44]:
df['duration'].max()

3025

**TASK: What is the most common education level for people who are unemployed?**

In [45]:
df[df['job'] == 'unemployed']['education'].value_counts()

secondary    68
tertiary     32
primary      26
unknown       2
Name: education, dtype: int64

**TASK: What is the average (mean) age for being unemployed?**

In [46]:
df[df['job'] == 'unemployed']['age'].mean()

40.90625